# Titanic Dataset Exploration

Thnis Notebook explores the Titanic Dataset

In [2]:
msg = "Hello World"
print(msg)

Hello World

In [3]:
# Import the pandas and numpy packages
import pandas as pd
import numpy as np

In [4]:
# Load the titanic dataset from the CSV file into a pandas dataframe
data = pd.read_csv('titanic-data/titanic3.csv')

In [5]:
# Show the top records in the dataframe
data.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [6]:
data.dtypes

pclass         int64
survived       int64
name          object
sex           object
age          float64
sibsp          int64
parch          int64
ticket        object
fare         float64
cabin         object
embarked      object
boat          object
body         float64
home.dest     object
dtype: object

In [7]:
# Replace '?' with NaN (missing data marker)
data.replace('?', np.nan, inplace= True)

# Convert the age and fare columns to float64 data type
data = data.astype({"age": np.float64, "fare": np.float64})